# Методы строк

#s = 'hello, world'
#print(len(s)) #возвращаем длинну строки
#print(s.capitalize()) #перевод 1 символа в верхний регистр
#print(s.center(20, '!')) #отцентровываем строку
#print(s.count('e', 0, 3)) #сколько символов в строке + можем указать диапазон
#print(s.find('l')) #в какой позиции находиться символ, если не будет, то ошибка
#print(s.replace('l', 't')) # позволяет заменить подстроку
# print(s.split(','))  #разбивает строки на разделители + можно поставить разделитель
# print(s.isdigit()) #состоит ли строка из цифр
# print(s.isalpha()) #состоит ли строка из букв
# print((s.islower())) #состоит ли она из цифр и букв
# print(s.isupper()) #состоил ли она из символов в верхнем регистре
