# print(10 / 2) # 5.0 To Do
# print(3 % 2) # 1 деление по модулю возвращает остаток от деления
# print(30 % 2) # 0
# print(12 // 5) # целочисленное деление
# print(7 // 3) # отбрасіваем дробную часть -1 тоесть =2
# print(7 / 3) # с дробной частью
#
# print(-5 -3) # =-8 как в матеше
# print(5 ** 2) #25 в степень
# print(5 ** 3) #125
# print(100 ** 0.5) #10 квадратный корень числа
#
# print(2 + 3 * 4) #приоритерты
# print((2 + 3) * 4) #приоритерты
#
# print(.5 + 2) #2,5 станная фишка
#
# print(0,5 + 2)  # 0, 7
#
# print(0.1 + 0.2) # 0.30000000...

